app/controllers/ingredient_controller.rb

INSERT INTO `ingredients` (`created_at`, `ingredient`, `updated_at`) VALUES ('2013-07-16 14:05:54', 'asdasdasd!', '2013-07-16 14:05:54')
---
  def create
  	Ingredient.create(:ingredient => params[:ingredient]);