app/controllers/recipe_controller.rb

SELECT `recipes`.* FROM `recipes` WHERE `recipes`.`id` = 35 LIMIT 1
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO `recipes` (`created_at`, `description`, `temperature`, `time`, `title`, `updated_at`) VALUES ('2013-07-29 15:26:26', NULL, NULL, NULL, NULL, '2013-07-29 15:26:26')
---
  def create
    @recipe = Recipe.create(params[:recipe])