app/controllers/unit_controller.rb

  def create
    Unit.create(:unit => params[:unit]);
---
INSERT INTO `units` (`created_at`, `unit`, `updated_at`) VALUES ('2013-07-16 14:37:59', 'dl', '2013-07-16 14:37:59')